app/views/comments/_form.html.erb

SELECT "states".* FROM "states"
---
    <%= f.label :state_id %>
    <%= f.select :state_id , @states.map { |s| [s.name, s.id] }, :selected => @ticket.state_id %>