app/controllers/admin/permissions_controller.rb

  def index
    @ability = Ability.new(@user)
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

    def find_user
      @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1