app/views/tickets/show.html.erb

SELECT 1 AS one FROM "assets" WHERE "assets"."ticket_id" = 1 LIMIT 1
---

  <% if @ticket.assets.exists? %>