app/controllers/comments_controller.rb

  def create
    @comment = @ticket.comments.build(params[:comment])
    @comment.user = current_user
    if @comment.save
---
INSERT INTO "comments" ("created_at", "state_id", "text", "ticket_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 09 Mar 2013 20:30:43 UTC +00:00], ["state_id", 2], ["text", "test comment"], ["ticket_id", 1], ["updated_at", Sat, 09 Mar 2013 20:30:43 UTC +00:00], ["user_id", 3]]

    def find_ticket
      @ticket = Ticket.find(params[:ticket_id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", "1"]]