app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 20 Jan 2013 23:24:42 UTC +00:00], ["description", "this is a test project"], ["name", "Test Project"], ["updated_at", Sun, 20 Jan 2013 23:24:42 UTC +00:00]]
---
  def create
    @project = Project.new(params[:project])
    if @project.save

UPDATE "projects" SET "name" = 'TextMate 2 beta', "description" = '', "updated_at" = '2013-01-27 17:21:34.462372' WHERE "projects"."id" = 1
---
  def update
    if @project.update_attributes(params[:project])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
    def find_project
      @project = Project.find(params[:id])