app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("created_at", "description", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 04 Feb 2013 04:05:14 UTC +00:00], ["description", "this is a test ticket"], ["project_id", 1], ["title", "test ticket"], ["updated_at", Mon, 04 Feb 2013 04:05:14 UTC +00:00]]
---
  def create
    @ticket = @project.tickets.build(params[:ticket])
    @ticket.user = current_user
    if @ticket.save

SELECT "states".* FROM "states"
---
  def show
    @comment = @ticket.comments.build
    @states = State.all

UPDATE "tickets" SET "title" = 'Make it really shiny!', "description" = '
---
  def update
    if @ticket.update_attributes(params[:ticket])

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]
---
  def destroy
    @ticket.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "4"]]
---
    def find_project
      @project = Project.for(current_user).find(params[:project_id])

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 4 AND "tickets"."id" = ? LIMIT 1  [["id", "2"]]
---
    def find_ticket
      @ticket = @project.tickets.find(params[:id])